;===============================================================================
;VERSION 0.1
;===============================================================================

%include      "fat12.inc"

;===============================================================================
;position of sectorNo.
;sectorNo.  ,  sec per rk
;return   dh = 磁头号,ch = 柱面号，cl = 起始扇区数 
;-------------------------------------------------------------------------------
%macro Sector_cal     2
       push    bx
       
       mov     word ax,%1
       mov     byte bl,%2
       div     bl
       inc     ah
       mov     cl,ah
       mov     dh,al
       and     dh,1  
       shr     al,1
       mov     ch,al 
           
       pop     bx
%endmacro
;-------------------------------------------------------------------------------
;the num of sector,driver device NO.
;-------------------------------------------------------------------------------
%macro Sector_read   2
       push    ax
       push    dx
       
  %%loop:
       mov     byte dl,%2
       mov     ah,02h
       mov     byte al,%1
       int     13h
       jc      %%loop
       
       pop     dx
       pop     ax
%endmacro
;===============================================================================
